//DFSORT  EXEC PGM=SORT
//SYSOUT DD SYSOUT=*
//SORTIN   DD DSN=FORM.INIT.BI04.MAJ.NONTRIE,DISP=SHR
//SORTOUT  DD DSN=SPHS.BI04.MAJ.TRIE,
//         SPACE=(CYL,(1,1)),
//         DISP=(,CATLG),
//         RECFM=FB,LRECL=80
//SYSIN    DD  *
  SORT FIELDS=(2,06,CH,A)
/*
