       IDENTIFICATION DIVISION.
       PROGRAM-ID. TRXXXXXX.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CLIOLD ASSIGN TO CLIOLD
                  FILE STATUS CLIOLD-STAT.

       DATA DIVISION.
       FILE SECTION.
       FD CLIOLD
           RECORDING MODE F.
       01 CLIOLD-ENR-FD PIC X(80).

       WORKING-STORAGE SECTION.
       77  CLIOLD-STAT PIC XX.

       PROCEDURE DIVISION.

           OPEN INPUT CLIOLD.
           IF CLIOLD-STAT NOT = '00' THEN
              DISPLAY ' OPEN ' CLIOLD-STAT
           END-IF.
