//TRAIN43X  JOB 1,'EXECUTION',MSGCLASS=A,REGION=0M,
//       MSGLEVEL=(1,1),CLASS=A,
//         NOTIFY=&SYSUID
//*
//STEP     EXEC PGM=TR43HELL
//STEPLIB  DD DSN=CICS.CICSTR01.BI04LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
