DEFINE PROGRAM(CI43CXCS) GROUP(TRX$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE PROGRAM(CI43TRAC) GROUP(TRX$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE PROGRAM(CI43TERR) GROUP(TRX$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) API(CICSAPI) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE FILE(TR43FCLI) GROUP(TRX$TR43)
        DSNAME(TRAIN43.BI04.CLIENT.VS) RLSACCESS(NO) LSRPOOLID(1)
        READINTEG(UNCOMMITTED) DSNSHARING(ALLREQS) STRINGS(3)
        RECORDSIZE(80) KEYLENGTH(6) STATUS(ENABLED) OPENTIME(FIRSTREF)
        DISPOSITION(SHARE) DATABUFFERS(4) INDEXBUFFERS(3) TABLE(NO)
        MAXNUMRECS(NOLIMIT) UPDATEMODEL(LOCKING) LOAD(NO)
        RECORDFORMAT(F) ADD(YES) BROWSE(YES) DELETE(YES) READ(YES)
        UPDATE(YES) JOURNAL(NO) JNLREAD(NONE) JNLSYNCREAD(NO)
        JNLUPDATE(NO) JNLADD(NONE) JNLSYNCWRITE(YES)
        RECOVERY(BACKOUTONLY) FWDRECOVLOG(NO) BACKUPTYPE(STATIC)
DEFINE TDQUEUE(TD43) GROUP(TRX$TR43)
DESCRIPTION(Destination used by samples using BI04)
        TYPE(INDIRECT) INDIRECTNAME(TD00)
