DEFINE MAPSET(MA43MNU) GROUP(TRY$TR43)
        RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)
DEFINE MAPSET(MA43DET) GROUP(TRY$TR43)
        RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)
DEFINE MAPSET(MA43LIS) GROUP(TRY$TR43)
        RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)
DEFINE MAPSET(MA43ERR) GROUP(TRY$TR43)
        RESIDENT(NO) USAGE(NORMAL) USELPACOPY(NO) STATUS(ENABLED)
DEFINE PROGRAM(CI43LIVS) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(ZA43) GROUP(TRY$TR43)
        PROGRAM(CI43LIVS) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43BRVS) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(ZB43) GROUP(TRY$TR43)
        PROGRAM(CI43BRVS) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43ADVS) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(ZC43) GROUP(TRY$TR43)
        PROGRAM(CI43ADVS) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43MDVS) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(ZD43) GROUP(TRY$TR43)
        PROGRAM(CI43MDVS) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43DLVS) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(ZE43) GROUP(TRY$TR43)
        PROGRAM(CI43DLVS) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43LITS) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(ZF43) GROUP(TRY$TR43)
        PROGRAM(CI43LITS) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43LIDB) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(Z143) GROUP(TRY$TR43)
        PROGRAM(CI43LIDB) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43BRDB) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(Z243) GROUP(TRY$TR43)
        PROGRAM(CI43BRDB) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43ADDB) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(Z343) GROUP(TRY$TR43)
        PROGRAM(CI43ADDB) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43MDDB) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(Z443) GROUP(TRY$TR43)
        PROGRAM(CI43MDDB) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43DLDB) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(Z543) GROUP(TRY$TR43)
        PROGRAM(CI43DLDB) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
DEFINE PROGRAM(CI43CMNU) GROUP(TRY$TR43)
        LANGUAGE(COBOL) RELOAD(NO) RESIDENT(NO) USAGE(NORMAL)
        USELPACOPY(NO) STATUS(ENABLED) CEDF(YES) DATALOCATION(BELOW)
        EXECKEY(USER) CONCURRENCY(QUASIRENT) DYNAMIC(NO)
        EXECUTIONSET(FULLAPI)
DEFINE TRANSACTION(Z043) GROUP(TRY$TR43)
        PROGRAM(CI43CMNU) TWASIZE(0) PROFILE(DFHCICST) STATUS(ENABLED)
        TASKDATALOC(BELOW) TASKDATAKEY(USER) STORAGECLEAR(NO)
        RUNAWAY(SYSTEM) SHUTDOWN(DISABLED) ISOLATE(YES) DYNAMIC(NO)
        ROUTABLE(NO) PRIORITY(1) TRANCLASS(DFHTCL00) DTIMOUT(10)
        RESTART(NO) SPURGE(YES) TPURGE(YES) DUMP(YES) TRACE(YES)
        CONFDATA(NO) OTSTIMEOUT(NO) ACTION(BACKOUT) WAIT(YES)
        WAITTIME(0,0,0) RESSEC(NO) CMDSEC(NO)
