//TRAIN43X JOB CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),NOTIFY=&SYSUID
// USER=SPHS
//*
//*  COMMANDE BATCH CICS
//* DEFINED A CONSOLE ENTRY IN YOUR CSD AS CONSNAME(INTERNAL)
//* YOU CAN SUBMIT COMMANDS TO YOUR CICS® REGION BY USING JCL.
//*
//IEFBR     EXEC PGM=IEFBR14
// F CICSTR01,'CEMT SET FI(BI04TR43) OPEN'
//*
